**Pandas**

pandas is the primary package for performing data analysis tasks in Python. pandas derives its name from panel data analysis and is the fundamental package that provides relational data structures (think Excel, SQL type) and a host of capabilities to play with those data structures. It is the most widely used package in Python for data analysis tasks, and is very good to work with cross sectional, time series, and panel data analysis. Python sits on top of NumPy and can be used with NumPy arrays and the functions in NumPy. How is pandas suited for a researcher’s needs:

+ Has a tabular data structure that can hold both homogenous and heterogenous data.
+ Very good indexing capabilities that makes data alignment and merging easy.
+ Good time series functionality. No need to use different data structures for time series and cross sectional data. Allows for both ordered and unordered time-series data.
+ A host of statistical functions developed around NumPy and pandas that makes a researcher’s task easy and fast.
+ Programming is lot simpler and faster.
+ Easily handles data manipulation and cleaning.
+ Easy to expand and shorten data sets. Comprehensive merging, joins, and group by functionality to join multiple data sets.

**Installing pandas** 

In order to check if pandas is installed, go to Package Manager and type pandas. By default, pandas already comes installed with a distribution of Anaconda. If the package is not installed, click on Install.

**Importing pandas**

In order to be able to use NumPy, first import it using import statement

In [1]:
import pandas as pd
import numpy as np

**Data Structures in pandas**

There are two basic data structures in pandas: Series and DataFrame

**Series:** It is similar to a NumPy 1-dimensional array. In addition to the values that are specified by the programmer, pandas attaches a label to each of the values. If the labels are not provided by the programmer, then pandas assigns labels ( 0 for first element, 1 for second element and so on). A benefit of assigning labels to data values is that it becomes easier to perform manipulations on the dataset as the whole dataset becomes more of a dictionary where each value is associated with a label.

In [2]:
series1 = pd.Series([10,20,30,40])
series1

0    10
1    20
2    30
3    40
dtype: int64

In [3]:
series1.values

array([10, 20, 30, 40], dtype=int64)

In [4]:
series1.index

RangeIndex(start=0, stop=4, step=1)

Custom Index:-

In [5]:
series2 = pd.Series([10,20,30,40,50], index=['one','two','three','four','five'])
series2

one      10
two      20
three    30
four     40
five     50
dtype: int64

The ways of accesing elements in a Series object are similar to what we have seen in NumPy, and you can perform NumPy operations on Series data arrays.

In [7]:
series2[1]

20

In [8]:
series2['two']

20

In [9]:
series2['three']

30

In [10]:
series2[['one', 'three', 'five']]

one      10
three    30
five     50
dtype: int64

In [14]:
series2 + 4

one      14
two      24
three    34
four     44
five     54
dtype: int64

In [11]:
series2 ** 3

one        1000
two        8000
three     27000
four      64000
five     125000
dtype: int64

In [13]:
series2[series2>30]

four    40
five    50
dtype: int64

In [14]:
np.sqrt(series2)

one      3.162278
two      4.472136
three    5.477226
four     6.324555
five     7.071068
dtype: float64

In [15]:
s = pd.Series(np.random.randn(4), name='daily returns')
s

0    1.222574
1    1.477986
2    0.265490
3   -0.175338
Name: daily returns, dtype: float64

In [16]:
np.abs(s)

0    1.222574
1    1.477986
2    0.265490
3    0.175338
Name: daily returns, dtype: float64

In [17]:
s.describe()

count    4.000000
mean     0.697678
std      0.781737
min     -0.175338
25%      0.155283
50%      0.744032
75%      1.286427
max      1.477986
Name: daily returns, dtype: float64

In [18]:
s.index = ['AMZN', 'AAPL', 'MSFT', 'GOOG']
s

AMZN    1.222574
AAPL    1.477986
MSFT    0.265490
GOOG   -0.175338
Name: daily returns, dtype: float64

In [19]:
s['AMZN']

1.2225739957718764

In [20]:
s['AMZN'] = 0
s

AMZN    0.000000
AAPL    1.477986
MSFT    0.265490
GOOG   -0.175338
Name: daily returns, dtype: float64

If you have a dictionary, you can create a Series data structure from that dictionary. Suppose you are interested in EPS values for firms and the values come from different sources and is not clean. In that case you dont have to worry about cleaning and aligning those values.

In [21]:
years = [90, 91, 92, 93, 94, 95]
f1 = {90:8, 91:9, 92:7, 93:8, 94:9, 95:11}
firm1 = pd.Series(f1,index=years)
firm1

90     8
91     9
92     7
93     8
94     9
95    11
dtype: int64

In [22]:
f2 = {90:14,92:9, 93:13, 94:5}
firm2 = pd.Series(f2,index=years)
firm2

90    14.0
91     NaN
92     9.0
93    13.0
94     5.0
95     NaN
dtype: float64

In [23]:
f3 = {93:10, 94:12, 95: 13}
firm3 = pd.Series(f3,index=years)
firm3

90     NaN
91     NaN
92     NaN
93    10.0
94    12.0
95    13.0
dtype: float64

NaN stands for missing or NA values in pandas. Make use of isnull() function to find out if there are any missing values in the data structure.

In [29]:
pd.isnull(firm3)

90     True
91     True
92     True
93    False
94    False
95    False
dtype: bool

A key feature of Series data is structures is that you don't have to worry about data alignment. For example, if we have run a word count program on two different files and we have the following data structures

In [24]:
dict1 = {'finance': 10, 'earning': 5, 'debt':8}
dict2 = {'finance' : 8, 'compensation':4, 'earning': 9}
count1 = pd.Series(dict1)
count2 = pd.Series(dict2)
print (count1)
print (count2)

debt        8
earning     5
finance    10
dtype: int64
compensation    4
earning         9
finance         8
dtype: int64

If we want to calculate the sum of common words in combined files, then we dont have to worry about data alignment. If we want to include all words, then we can take care of NaN values and compute the sum. By default, Series data structure ignores NaN values. NaN values stand for missing data values.

In [25]:
count1+count2

compensation     NaN
debt             NaN
earning         14.0
finance         18.0
dtype: float64

**Data Frame**

DataFrame is a tabular data structure in which data is laid out in rows and column format (similar to a CSV and SQL file), but it can also be used for higher dimensional data sets. The DataFrame object can contain homogenous and heterogenous values, and can be thought of as a logical extension of Series data structures. In contrast to Series, where there is one index, a DataFrame object has one index for column and one index for rows. This allows flexibility in accessing and manipulating data.

In [27]:
data = pd.DataFrame({'price':[95, 25, 85, 41, 78],
                     'ticker':['AXP', 'CSCO', 'DIS', 'MSFT', 'WMT'],
                     'company':['American Express', 'Cisco', 'Walt Disney','Microsoft', 'Walmart']})
data

            company  price ticker
0  American Express     95    AXP
1             Cisco     25   CSCO
2       Walt Disney     85    DIS
3         Microsoft     41   MSFT
4           Walmart     78    WMT

If a column is passed with no values, it will simply have NaN values

In order to access a column, simply mention the column name

In [29]:
data['company']

0    American Express
1               Cisco
2         Walt Disney
3           Microsoft
4             Walmart
Name: company, dtype: object

In [30]:
data.company

0    American Express
1               Cisco
2         Walt Disney
3           Microsoft
4             Walmart
Name: company, dtype: object

In [31]:
data.iloc[2]

company    Walt Disney
price               85
ticker             DIS
Name: 2, dtype: object

In [32]:
data.ix[data.ticker < 'DIS']

            company  price ticker
0  American Express     95    AXP
1             Cisco     25   CSCO

In order to add additional columns

In [33]:
data['Year'] = " "
data

            company  price ticker Year
0  American Express     95    AXP
1             Cisco     25   CSCO
2       Walt Disney     85    DIS
3         Microsoft     41   MSFT
4           Walmart     78    WMT

In [34]:
data['pricesquared'] = data.price**2
data

            company  price ticker Year  pricesquared
0  American Express     95    AXP               9025
1             Cisco     25   CSCO                625
2       Walt Disney     85    DIS               7225
3         Microsoft     41   MSFT               1681
4           Walmart     78    WMT               6084

In [35]:
del data['pricesquared']
data

            company  price ticker Year
0  American Express     95    AXP
1             Cisco     25   CSCO
2       Walt Disney     85    DIS
3         Microsoft     41   MSFT
4           Walmart     78    WMT

** Reading **

In [ ]:
con = 
a = "select * from tab1"

In [ ]:
ab=pd.read_sql(a,con=con)

In [ ]:
pd.read_table

In [36]:
df = pd.read_csv('https://github.com/QuantEcon/QuantEcon.lectures.code/raw/master/pandas/data/test_pwt.csv')
type(df)

pandas.core.frame.DataFrame

In [37]:
df

,country,country isocode,year,POP,XRAT,tcgdp,cc,cg
0,Argentina,ARG,2000,37335.653,0.999500,2.950722e+05,75.716805,5.578804
1,Australia,AUS,2000,19053.186,1.724830,5.418047e+05,67.759026,6.720098
2,India,IND,2000,1006300.297,44.941600,1.728144e+06,64.575551,14.072206
3,Israel,ISR,2000,6114.570,4.077330,1.292539e+05,64.436451,10.266688
4,Malawi,MWI,2000,11801.505,59.543808,5.026222e+03,74.707624,11.658954
5,South Africa,ZAF,2000,45064.098,6.939830,2.272424e+05,72.718710,5.726546
6,United States,USA,2000,282171.957,1.000000,9.898700e+06,72.347054,6.032454
7,Uruguay,URY,2000,3219.793,12.099592,2.525596e+04,78.978740,5.108068

In [38]:
df.columns

Index(['country', 'country isocode', 'year', 'POP', 'XRAT', 'tcgdp', 'cc',
       'cg'],
      dtype='object')

In [42]:
df.shape

(8, 8)

In [43]:
labels = ['country', 'tcgdp']
df[labels]

         country         tcgdp
0      Argentina  2.950722e+05
1      Australia  5.418047e+05
2          India  1.728144e+06
3         Israel  1.292539e+05
4         Malawi  5.026222e+03
5   South Africa  2.272424e+05
6  United States  9.898700e+06
7        Uruguay  2.525596e+04

In [44]:
df.iloc[2:5,0:4]

  country country isocode  year          POP
2   India             IND  2000  1006300.297
3  Israel             ISR  2000     6114.570
4  Malawi             MWI  2000    11801.505

In [45]:
df.loc[df.index[2:5], ['country', 'tcgdp']]

  country         tcgdp
2   India  1.728144e+06
3  Israel  1.292539e+05
4  Malawi  5.026222e+03

In [46]:
df = df[['country','POP','tcgdp']]
df

         country          POP         tcgdp
0      Argentina    37335.653  2.950722e+05
1      Australia    19053.186  5.418047e+05
2          India  1006300.297  1.728144e+06
3         Israel     6114.570  1.292539e+05
4         Malawi    11801.505  5.026222e+03
5   South Africa    45064.098  2.272424e+05
6  United States   282171.957  9.898700e+06
7        Uruguay     3219.793  2.525596e+04

In [47]:
df = df.set_index('country')
df

                       POP         tcgdp
country
Argentina        37335.653  2.950722e+05
Australia        19053.186  5.418047e+05
India          1006300.297  1.728144e+06
Israel            6114.570  1.292539e+05
Malawi           11801.505  5.026222e+03
South Africa     45064.098  2.272424e+05
United States   282171.957  9.898700e+06
Uruguay           3219.793  2.525596e+04

In [53]:
df['POP'].unique()

array([   37335.653,    19053.186,  1006300.297,     6114.57 ,
          11801.505,    45064.098,   282171.957,     3219.793])

In [54]:
df.columns = 'population', 'total GDP'
df

                population     total GDP
country
Argentina        37335.653  2.950722e+05
Australia        19053.186  5.418047e+05
India          1006300.297  1.728144e+06
Israel            6114.570  1.292539e+05
Malawi           11801.505  5.026222e+03
South Africa     45064.098  2.272424e+05
United States   282171.957  9.898700e+06
Uruguay           3219.793  2.525596e+04

In [55]:
df['GDP percap'] = df['total GDP'] * 1e6 / df['population']
df

                population     total GDP    GDP percap
country
Argentina        37335.653  2.950722e+05  7.903229e+06
Australia        19053.186  5.418047e+05  2.843643e+07
India          1006300.297  1.728144e+06  1.717325e+06
Israel            6114.570  1.292539e+05  2.113867e+07
Malawi           11801.505  5.026222e+03  4.258967e+05
South Africa     45064.098  2.272424e+05  5.042648e+06
United States   282171.957  9.898700e+06  3.508038e+07
Uruguay           3219.793  2.525596e+04  7.843971e+06

In [56]:
df.groupby("country").max("Population")

KeyError: 'country'

In [57]:
df['GDP percap'].plot(kind='bar')

In [58]:
import matplotlib.pyplot as plt

plt.show()

In [59]:
df = df.sort_values(by='GDP percap', ascending=False)
df

                population     total GDP    GDP percap
country
United States   282171.957  9.898700e+06  3.508038e+07
Australia        19053.186  5.418047e+05  2.843643e+07
Israel            6114.570  1.292539e+05  2.113867e+07
Argentina        37335.653  2.950722e+05  7.903229e+06
Uruguay           3219.793  2.525596e+04  7.843971e+06
South Africa     45064.098  2.272424e+05  5.042648e+06
India          1006300.297  1.728144e+06  1.717325e+06
Malawi           11801.505  5.026222e+03  4.258967e+05

In [ ]:
pd.concat --> 


2 csv files 


Horizontally 

df1 = pd.read_csv("f.csv")
df2 = pd.read_csv("f2.csv")

df3 = pd.concat(df1,df2,df9)    # employee id

df4                         # employeed id

In [ ]:
df5 = pd.merge(df3,df4,on=('employee id'),how='inner')

In [49]:
df.head(2)

           population     total GDP    GDP percap
country
Argentina   37335.653  295072.21869  7.903229e+06
Australia   19053.186  541804.65210  2.843643e+07